# GetCaption Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryViewModes..::..GetCaption Method
TemporaryViewModes Class See Also
---
A text caption to use for the given mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public string GetCaption(
	TemporaryViewMode mode
)
```

Visual Basic
---
```text
Public Function GetCaption ( _
	mode As TemporaryViewMode _
) As String
```

Visual C++
---
```text
public:
String^ GetCaption(
	TemporaryViewMode mode
)
```

# ### Parameters
mode
    Type: Autodesk.Revit.DB..::..TemporaryViewMode The mode to get a caption for.
# ### Return Value
Text of the caption. The text is localized.
# Remarks
The text appears in the UI on the temporary frame when the view is in the temporary mode.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
TemporaryViewModes Class
Autodesk.Revit.DB Namespace